{"_id":{"$oid":"623002f6ca0258311c44bb46"},"Title":"Interstellar","Description":"A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.","Genre":{"Name":"Science Fiction","Description":"Science Fiction is a genre of speculative fiction which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is a British-American film director, producer, and screenwriter. His films have grossed more than US$5 billion worldwide, and have garnered 11 Academy Awards from 36 nominations.","Birth":"July 30, 1970"},"ImagePath":"interstellar.png","Featured":true}
{"_id":{"$oid":"6230e185d31d6c89a2c5b023"},"Title":"The Raid","Description":"A S.W.A.T. team becomes trapped in a tenement run by a ruthless mobster and his army of killers and thugs.","Genre":{"Name":"Action","Description":"Action is a genre in which the primary feature is the constant slam-bang of fights, chases, explosions, and clever one-liners."},"Director":{"Name":"Gareth Evans","Bio":"Gareth Evans is a Welsh film director, screenwriter, editor, and action choreographer.","Birth":"1980"},"ImagePath":"theraid.png","Featured":true}
{"_id":{"$oid":"6230e452d31d6c89a2c5b024"},"Title":"The Dark Knight","Description":"When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.","Genre":{"Name":"Action","Description":"Action is a genre in which the primary feature is the constant slam-bang of fights, chases, explostions, and clever one-liners."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is a British-American film director, producer, and screenwriter. His films have grossed more than US$5 billion worldwide, and have garnered 11 Academy Awards from 36 nominations.","Birth":"March 27, 1970"},"ImagePath":"thedarkknight.png","Featured":true}
{"_id":{"$oid":"6230eb8b0cf7a94b64d70efd"},"Title":"Superbad","Description":"Two co-dependent high school seniors are forced to deal with separation anxiety after their plan to stage a booze-soaked party goes awry.","Genre":{"Name":"Comedy","Description":"A genre that uses laughter and humor in order to entertain and amuse."},"Director":{"Name":"Greg Mottola","Bio":"Greg Mottola is an American film director, screenwriter, and television director.","Birth":"July 11, 1964"},"ImagePath":"superbad.png","Featured":true}
{"_id":{"$oid":"6230edc20cf7a94b64d70efe"},"Title":"Melancholia","Description":"Two sisters find their already strained relationship challenged as a mysterious new planet threatens to collide with Earth.","Genre":{"Name":"Drama","Description":"Drama is a category of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Lars von Trier","Bio":"Lars von Trier is a Danish film director and screenwriter with a prolific and controversial career spanning more than four decades.","Birth":"April 30, 1956"},"ImagePath":"melancholia.png","Featured":true}
{"_id":{"$oid":"623102030cf7a94b64d70eff"},"Title":"The Good, the Bad, and the Ugly","Description":"A bounty hunting scam joins two mean in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.","Genre":{"Name":"Western","Description":"The Western is a genre of fiction and film set primarily in the latter half of the 19th century and the early 20th century in the Western United States, which is styled the Old West or the Wild West."},"Director":{"Name":"Sergio Leone","Bio":"Sergio Leone was an Italian film director, producer and screenwriter credited as the creator of the Spaghetti Western genre and widely regarded as one of the most influential directors in the history of cinema.","Birth":"January 03, 1929","Death":"April 30, 1989"},"ImagePath":"thegoodthebadandtheugly.png","Featured":true}
{"_id":{"$oid":"623105440cf7a94b64d70f00"},"Title":"Inception","Description":"A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O., but his tragic past may doom the project and his team to disaster.","Genre":{"Name":"Science Fiction","Description":"Science Fiction is a genre of speculative fiction which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is a British-American film director, producer, and screenwriter. His films have grossed more than US$5 billion worldwide, and have garnered 11 Academy Awards from 36 nominations.","Birth":"July 30, 1970"},"ImagePath":"inception.png","Featured":true}
{"_id":{"$oid":"623108610cf7a94b64d70f01"},"Title":"Spirited Away","Description":"During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and spirits, and where humans are changed into beasts.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and sometimes inspired by mothology and folklore."},"Director":{"Name":"Hayao Miyazaki","Bio":"Hayao Miyazaki is a Japanese animator, director, producer, screenwriter, author, and manga artist. A co-founder of Studio Ghibli, he has attained international acclaim as a masterful storyteller and creator of Japanese animated feature films, and is widely regarded as one of the most accomplished filmmakers in the history of animation.","Birth":"January 05, 1941"},"ImagePath":"spiritedaway.png","Featured":true}
{"_id":{"$oid":"62310b680cf7a94b64d70f02"},"Title":"Ex Machina","Description":"A young programmer is selected to participate in a ground-breaking experiment in synthetic intelligence by evaluating the human qualitites of a highly advanced humanoid A.I.","Genre":{"Name":"Science Fiction","Description":"Science Fiction is a genre of speculative fiction which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"Director":{"Name":"Alex Garland","Bio":"Alex Garland is an English writer and filmmaker. He rose to prominence as a novelist in the late 1990s with his novel The Beach, which led some critics to call Garland a key voice of Generation X.","Birth":"May 26, 1970"},"ImagePath":"exmachina.png","Featured":true}
{"_id":{"$oid":"62310f570cf7a94b64d70f03"},"Title":"Kill Bill: Vol. 1","Description":"After awakening from a four-year coma, a former assassin wreaks vengeance on the team of assassins who betrayed her.","Genre":{"Name":"Action","Description":"Action is a genre in which the primary feature is the constant slam-bang of fights, chases, explosions, and clever one-liners."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Tarantino is an American filmmaker, actor, film critic and author. His films are characterized by nonlinear storylines, dark humor, stylized violence, extended dialogue, pervasive use of profanity, ensemble casts, references to popular culture, alternate history, and neo-noir.","Birth":"March 27, 1963"},"ImagePath":"kill_bill:_volume_1.png","Featured":true}
